let handler = async (m, { conn }) => {
    const name = conn.getName(m.sender);
    let videoUrl = 'https://telegra.ph/file/b490d4573dc053ce8b866.mp4';
    let tagUser = '@' + m.sender.split("@s.whatsapp.net")[0];
    let more = String.fromCharCode(8206);
    let teks = `${pickRandom([`●▬▬▬ஜƸ̵̡⁠Ӝ̵̨̄⁠Ʒஜ▬▬▬●
*❘╼╼𓏪 قائـمـة 📜 الاوامـر 𓏪╾╾❘*
── • ◈ • ──
*🎶✬⃝┇اهلا👋*
*🎶✬⃝┇أنـا اسـمـــي "زورو"*
*🎶✬⃝┇الـمطـــور* "ZORO"
*🎶✬⃝┇الـبــوت لـجــروبـات الـواتـســاب*
*🎶✬⃝┇لـاتـنـســی قـبــل كــل امــر ﹙.﹚*
*🎶✬⃝┇هــا لــك أوامـــر الـبــوت ☟*

✦ ───『 *game* 』─── ⚝
◈ .علم
◈ .شطرنج
◈ .رهان <القيمه الي بتراهن فيها>
◈ .حساب
◈ .حجر
◈ .اكس <اكتب اسم الغرفه>
◈ .اهجم
◈ .وار زون
◈ .ايدت
◈ .ايموجي
◈ .جمع
◈ .خمن
◈ .رتب
◈ .رياضه
◈ .سؤال
◈ .فكك
◈ .كت
◈ .ميمز
◈ .نرد
╰──────────⳹
✦ ───『 *AI* 』─── ⚝
◈ .بحث
◈ .لانمي
◈ .سيري
◈ .لكرتون
╰──────────⳹
✦ ───『 *tools* 』─── ⚝
◈ .الطقس
◈ .تغميق
◈ .توضيح
◈ .تغميق
◈ .مزيف
◈ .انطق
◈ .شورت
◈ .شورتت
◈ .اقرى-المزيد
◈ .ريمبو
◈ .اعدادات
◈ .تليجراف
◈ .ترجم
◈ .انطق
◈ .رقم-واتس
◈ .انطقي
◈ .خلفيه
◈ .خلفية
╰──────────⳹
✦ ───『 *img* 』─── ⚝
◈ .ميسي
◈ .سي-ار-7
◈ .كريستيانو
◈ .تطقيم
◈ .طقم
◈ .بين
╰──────────⳹
✦ ───『 *fun* 』─── ⚝
◈ .اختفاء <الرساله>
◈ .تحقق @منشن
◈ .شاذ مع المنشن
◈ .الحب
◈ .اسئلني مع السؤال
◈ .هل
◈ .زوجني
◈ .توب  Ⓛ
◈ .مات @منشن
◈ .تيس
◈ .خروف
◈ .حمار
◈ .كلامي(.كلامي مرحبا)
◈ .قط
◈ .كلب
◈ .شخصيه
◈ .ذكاء
◈ .رفس
◈ .رفيق
◈ .زواج
◈ .طلاق
◈ .غباء
◈ .كلب
╰──────────⳹
✦ ───『 *downloader* 』─── ⚝
◈ .انستا
◈ .تيك <url>
◈ .اغنيه
◈ .يوت
◈ .يوت-اغنيه
◈ .وايبلاري
╰──────────⳹
✦ ───『 *downloder* 』─── ⚝
◈ .ام-بي-3
╰──────────⳹
✦ ───『 *economy* 』─── ⚝
◈ .اضافه-ذهب <@منشن>
◈ .اضافه-اكس-بي <@منشن>
◈ .البنك
◈ .شراء-دجاج
◈ .مصارعه-الديوك <amount>
◈ .شراء
◈ .يومي
◈ .ايداع
◈ .مغامره <الكميه> <اللون(احمر/اسود)>
◈ .تحويل الائتمان [الكميه] [@منشن]
◈ .مستوى-اعلى
◈ .رانك
◈ .اسرق
◈ .روليت <كميه> <لون(احمر/اسود)>
◈ .محفظه
◈ .ينسحب
◈ .عمل
╰──────────⳹
✦ ───『 *core* 』─── ⚝
◈ .تصنيف
╰──────────⳹
✦ ───『 *group* 』─── ⚝
◈ .<وصف <الوصف الجديد
◈ .<تغيير-الاسم <اسم القروب
◈ .حذف
◈ .حذف-التحذير @منشن
◈ .لينك
◈ .بروفايل
◈ .تغيير-اللينك
◈ .وداع <منشن>
◈ .قروب *غلق/فتح*
◈ .ترحيب <الرساله>
◈ .منشن
◈ .مخفي
◈ .تحذير @منشن
◈ .انذار
◈ .منشني
╰──────────⳹
✦ ───『 *maker* 』─── ⚝
◈ .صورتي
◈ .بطاقتي
◈ .لوغو
◈ .تشويش
◈ .سيمب-كارد
◈ .غبي
◈ .تويت
◈ .فتاه
◈ .كومينت
╰──────────⳹
✦ ───『 *owner* 』─── ⚝
◈ .بريم
◈ .بان @user
◈ .حظر
◈ .اعلان
◈ .تنضيف
◈ .فك-الحظر
◈ .الغاء-بريم @user
◈ .انضم
◈ .ريسيت3
◈ .ريسيت
◈ .ريسيت5
◈ .سيت
◈ .فك-البان @user
◈ .الغاء-الحظر
◈ .تحديث
◈ .م
◈ .حذف البلوجين <name>
◈ .تهكير
╰──────────⳹
✦ ───『 *rg* 』─── ⚝
◈ .ريق <الاسم.العمر>
◈ .ميسون
◈ .اين راق
╰──────────⳹
✦ ───『 *sticker* 』─── ⚝
◈ .ستيكري
◈ .حول
◈ .ملصق
◈ .الى-صوره
◈ .الى-فيديو
◈ .اكتب1
◈ .اكتب2
◈ .اكتب3
◈ .اكتب4
◈ .اكتب5
◈ .اكتب6
◈ .اكتب7
◈ .اكتب8
◈ .سرقه
╰──────────⳹
ZORO
*┑━━━┇حـقـوق الـمـطـور┇━━━┍*
*│⇆ رقـم الـمطـور زورو: ↯*
+967773849005
*┙━━━┇حـقـوق الـمـطـور┇━━━┕*


*~.¸¸ ❝ ZORO BOT ❝ ¸¸.~*`])}`.trim();

    conn.sendMessage(m.chat, {
        video: { url: videoUrl },
        caption: teks,
        gifPlayback: true,
        gifAttribution: 0
    }, { quoted: m });
};

handler.command = ['menu', 'help', 'h', 'مساعده', 'مهام', 'الاوامر', 'المهام'];

export default handler;

function pickRandom(list) {
    return list[Math.floor(Math.random() * list.length)];
                   }